[{"publisher":"Qeios Ltd","abstract":"<jats:p>Scientific posters are a frequently used medium of communication at conferences and have grown in popularity over the last decades. However, the design of the traditional poster has largely remained stagnant despite emergence of new relevant research that could have unique implications for how scientific posters are designed for optimal learning. In this study, we examine the impact of a new minimalist, 'billboard-style' poster designed to transmit at least one piece of knowledge more efficiently. Attitudinal reactions to new and traditional poster designs were compared in two field studies. We found the billboard-style poster was perceived as easier to learn from, more interactive, and better for promoting scientific discovery. This supports the billboard-style poster design for use in scientific poster sessions. Results also suggested that future improvements to billboard-style designs should aim to efficiently communicate study methods in addition to key findings. Ultimately, these two field studies provide some initial evidence that meaningful improvements in poster effectiveness are possible, and that billboard-style layouts may be a step in the right direction that is worth developing further.\n</jats:p>","DOI":"10.32388/p7n5bo","type":"manuscript","source":"Crossref","title":"A step in the right direction: Billboard-style posters preferred overall at two conferences, but should include more methods and limitations","author":[{"given":"Benard","family":"Oronje","sequence":"first","affiliation":[]},{"ORCID":"http://orcid.org/0000-0002-1324-8801","authenticated-orcid":true,"given":"Mike","family":"Morrison","sequence":"additional","affiliation":[]},{"given":"Chris","family":"Suharlim","sequence":"additional","affiliation":[]},{"given":"Kimberly","family":"Folkman","sequence":"additional","affiliation":[]},{"given":"Angela","family":"Glaude-Hosh","sequence":"additional","affiliation":[]},{"given":"Victoria","family":"Jeisy-Scott","sequence":"additional","affiliation":[]}],"issued":{"date-parts":[[2022,11,17]]},"URL":"http://dx.doi.org/10.32388/p7n5bo"}]